In [1]:
import pandas as pd 

df= pd.read_csv('TestMax.csv')
# max(df[["Max1","Max2","Max3"]])
df

   Unnamed: 0  Year1  Max1  Max2  Max3
0           0   2001    10   101    87
1           1   2003   103    19    88
2           2   2003    21    23    89
3           3   2004    27    28    91

In [2]:
df["MaxValue"] = df.apply(lambda x: max(x['Max1'],x['Max2'],x['Max3']), axis=1)

In [11]:
df.drop(columns=["Max1","Max2","Max3"])

   Unnamed: 0  Year1  MaxValue
0           0   2001       101
1           1   2003       103
2           2   2003        89
3           3   2004        91